{"images/car_parts/external/01455a068bbf45.jpg": "The image shows the front grille and logo of a Hyundai vehicle. The grille is black with horizontal slats and features the prominent Hyundai logo in the center, which is the company's distinctive stylized \"H\" emblem on a wing-shaped background. The vehicle's body is painted in a metallic orange or copper color, giving the image a warm and vibrant tone.", "images/car_parts/external/0009c06ccbfd91.jpg": "This image depicts the rear taillight assembly of a Volkswagen Jetta. The distinctive red brake light and turn signal clusters are visible, along with the \"Jetta\" model name emblazoned on the body panel below the taillights. The taillight housing has a clear lens section as well as the iconic Volkswagen red rectangular light design. This is an exterior view capturing the stylish and recognizable taillight design specific to the Volkswagen Jetta model.", "images/car_parts/external/0082db3bd3052c.jpg": "The image shows the front grill and Audi emblem of a blue Audi vehicle. The iconic four interlocked rings Audi logo is prominently displayed in the center of the chrome grill, which has horizontal slats and surrounds a lower grille opening. This frontal section highlights the distinctive branded design for Audi's luxury vehicle models.", "images/car_parts/external/00365eaf470ebd.jpg": "The image depicts a close-up view of the headlight assembly on a red-colored vehicle. The modern, dual-projector headlight design has a clear lens cover with distinct circular projector units housed in a black casing. Based on the sleek styling, this appears to be a headlight from a modern sedan or coupe model, though the specific make and model are not evident from just this component view.", "images/car_parts/external/000c94badb9abd.jpg": "The image shows the front headlight assembly of a red passenger vehicle. The headlight has a clear polycarbonate lens with intricate internal reflector details visible. The vehicle's body panels are painted in a deep crimson red metallic finish. This appears to be the headlight from a modern luxury sedan or SUV, likely a Mercedes-Benz model given the distinct styling cues.", "images/car_parts/external/001ffec9846008.jpg": "The image shows the front grille and bumper area of what appears to be a Jaguar luxury vehicle. The grille has the iconic Jaguar leaping cat emblem centered and features a black honeycomb mesh design pattern. The bumper is finished in a bright white color, giving the front end a striking contrast. This is a close-up shot highlighting the distinct styling elements of this Jaguar's front fascia and grille assembly.", "images/car_parts/external/00165471bc4213.jpg": "This image shows the front headlight assembly of a red luxury car, likely a BMW or similar high-end German make and model. The sleek, angular headlight design features dual circular lamps with a stylish chrome trim surround. The headlights curve elegantly into the fenders, highlighting the vehicle's sporty and premium aesthetic. The part appears to be the driver's side headlight unit in pristine condition, showcasing the intricate details and craftsmanship of the automotive lighting component.", "images/car_parts/external/0027be83e64c7a.jpg": "The image shows the front kidney grille of a BMW car. The classic vertically slated black grille with the blue and white BMW roundel logo in the center is a distinctive design feature found on many BMW models. The grille appears to be from a recent BMW model given its modern styling, though the specific model is not identifiable from this close-up view of just the front grille section against a red car body.", "images/car_parts/external/0124164787a284.jpg": "The image shows the front grill and bumper area of a Nissan vehicle. The prominent Nissan logo is visible in the center of the chrome-accented grill. The front bumper appears to be in a dark color, possibly black or a dark gray shade. This is a close-up view focused on highlighting the Nissan branding and styling of the vehicle's front-end design.", "images/car_parts/external/000fb42e53ad5c.jpg": "The image shows the headlight assembly of a Ford vehicle. The headlight housing appears to be a sleek, modern design with a chrome accent around the clear lens. The make and model are not explicitly stated, but based on the styling cues, this appears to be a recent model Ford car or crossover vehicle. The headlight depicts contemporary automotive lighting technology with its projector beam design.", "images/car_parts/external/0028a2270ec72a.jpg": "The image shows a close-up view of the front bumper and fog light assembly of a white vehicle. The fog light housing is black with a chrome accent trim piece surrounding the clear lens fog light bulb. This appears to be an OEM factory fog light assembly for a modern passenger vehicle or light truck/SUV.", "images/car_parts/external/01343c1e481432.jpg": "The image shows a close-up view of the front headlight assembly of a modern car. The headlight features a sleek, angular design with clear plastic lenses allowing the projector-beam style headlamp to be visible. The headlight assembly appears to be in pristine condition, likely from a new or well-maintained vehicle. Without any identifying badges or markings, the specific make and model of the vehicle cannot be determined from this image alone.", "images/car_parts/external/0064f7a46ef4f3.jpg": "The image shows the headlight assembly of a vehicle. It appears to be a modern LED headlight design with a projector-style low beam and separate LED accent lights or daytime running lights. The headlight has a sleek, angular styling characteristic of contemporary automotive designs. Based on the \"XCAR\" logo visible, this headlight assembly likely belongs to a model from the Chinese automaker Xcar or Xiaopeng Motors.", "images/car_parts/external/0094697bec5de9.jpg": "The image shows the front grille and headlights of a Chrysler Pacifica minivan. The grille has the distinctive winged Chrysler emblem in the center and features a black mesh pattern. The headlights have a sleek, modern design. The front bumper has integrated fog lights and a skid plate style lower section, giving the minivan an athletic and rugged appearance.", "images/car_parts/external/014dec45a75475.jpg": "This image shows the headlight assembly of a modern car or vehicle. The headlight has a sleek and stylish design with a circular outer ring and inner projector lens setup. The outer chrome ring gives it a premium and elegant look. The inner projector lens has an orange turn signal light integrated into the assembly. Based on the styling and design cues, this appears to be the headlight from a luxury or high-end vehicle model, potentially from a European or American brand known for its sophisticated automotive designs.", "images/car_parts/external/0027ea04b228e5.jpg": "This image shows the front fog light assembly on a Toyota vehicle. The fog light is mounted in a recessed housing in the lower front bumper area, and the body-colored plastic bumper cover surrounds the fog light bezel. The fog light has a clear lens and a bright illumination source inside the housing. This fog lamp is an automotive exterior lighting component designed to provide improved visibility in foggy or hazy driving conditions.", "images/car_parts/external/001d57fece0190.jpg": "The image shows the front grille of a Honda vehicle. It features the distinctive Honda emblem in a chrome finish against a black horizontal slat grille design. The grille area appears to be part of the front bumper assembly, with a lower gray plastic trim piece visible below the grille opening. This grille component is a recognizable styling element that identifies the make and model as a recent Honda automobile.", "images/car_parts/external/0241fa925bae9d.jpg": "The image shows the rear taillight assembly of a modern Acura TL sedan. The taillight has a distinctive shape with multiple LED light elements arranged in a angular, wrap-around style design. The burgundy red outer lens cover and chrome accents give the taillight a sleek, premium appearance befitting the Acura brand's luxury positioning. The \"TL\" model badge is prominently displayed, indicating this is the taillight from an Acura TL model vehicle.", "images/car_parts/external/001eac55310b88.jpg": "The image shows the front grille and bumper of a red Scion vehicle. The Scion emblem, featuring a stylized star, is prominently displayed in the center of the black honeycomb-patterned grille. The grille and bumper design give the car an aggressive and sporty appearance. This is an up-close shot focused on the distinctive front-end styling of this Scion model.", "images/car_parts/external/00666919d93511.jpg": "The image shows the rear tail light assembly of a Toyota Vraggo iDer model vehicle. The tail lights have a sleek design with distinct red LED elements and clear lens covers. The maroon-colored body panel and embossed model name \"Vraggo iDer\" on the rear quarter panel are also visible, indicating this is a Toyota sedan or hatchback model.", "images/car_parts/external/01cb97b0463e17.jpg": "The image shows the front grille and kidney-shaped BMW badge of a modern BMW luxury car. The distinctive vertically-slated double grille design with chrome accents and the iconic BMW roundel logo in the center clearly identify this as the front end styling of a recent BMW model automobile.", "images/car_parts/internal/005eb85708abb4.jpg": "The image shows the instrument cluster or gauge cluster of a vehicle. The cluster features three round analog gauges: a tachometer on the left displaying engine RPM, a speedometer in the center showing speed in km/h up to 200, and another gauge on the right likely displaying fuel level or temperature. The gauges have a black background with red needles. There is also a small digital display showing likely the odometer reading or trip information. The model or make of the vehicle is not explicitly stated, but the design and layout suggest it could be from a mainstream vehicle brand.", "images/car_parts/internal/00a58a6daab988.jpg": "This image depicts the center console and gear shifter mechanism of a luxury vehicle. The make and model are not explicitly stated, but the image shows a rotary-style electronic gear selector with a chrome and mesh finish, surrounded by various buttons and controls for various vehicle functions like climate control and other settings. The gear selector shows the PRND (Park, Reverse, Neutral, Drive) indicators, suggesting an automatic transmission. The overall design and materials used convey a premium and modern interior.", "images/car_parts/internal/0037098684c517.jpg": "The image shows the interior dashboard and center console of a Volkswagen car model. The steering wheel, infotainment system display, climate control knobs, and gear shift lever are visible. The leather-wrapped gear shifter suggests it is likely a manual transmission. The dashboard materials appear to be a combination of hard plastics and soft-touch surfaces in black, gray, and beige colors, giving an upscale look to the interior trim.", "images/car_parts/internal/00c3a15808518f.jpg": "The image shows the interior center console and gear shift area of a car. The make and model are not explicitly visible, but it appears to have an automatic transmission with a gear shift lever, climate control buttons, and other controls mounted on the center console. The interior has a beige/tan color scheme for the seats and trim panels.", "images/car_parts/internal/0165b1b0bca113.jpg": "The image shows the interior dashboard and center console of a Volkswagen vehicle model. It displays the steering wheel with the Volkswagen emblem, instrument cluster, infotainment system with radio and climate controls, and the gear shift lever. The interior has a black and grey color scheme, giving it a modern and minimalistic look. This is a detailed view of the cockpit layout and components in a Volkswagen car model.", "images/car_parts/internal/00a0040a177c98.jpg": "The image shows the steering wheel, dashboard, and instrument cluster of a Mini Cooper vehicle. The steering wheel has the Mini logo at the center and features a black leather wrap with multi-function controls on the spokes. The instrument cluster has a large central speedometer with a tachometer inset and displays for fuel level, engine temperature, and other vehicle information surrounding it. The dashboard has a textured black plastic surface with circular air vents and controls for various systems.", "images/car_parts/internal/001fdc98f85ef1.jpg": "Ford steering wheel and dashboard interior view of a Ford vehicle showing the black leather-wrapped multi-function steering wheel with Ford logo, instrument cluster, center console with controls and displays in an automotive showroom setting.", "images/car_parts/internal/0076fd46ad0a6d.jpg": "The image shows the interior dashboard and center console of a car. It appears to be from a Volkswagen model based on the design and layout. The console features audio controls, climate control vents, and various buttons and knobs for vehicle settings and functions. The gear shift is visible in the center with chrome accents around the console area. The steering wheel and instrument cluster can also be partially seen in the frame, giving an overall view of the driver's cockpit area inside the vehicle interior.", "images/car_parts/internal/00a15450c6bfdb.jpg": "The image shows the steering wheel and dashboard of a Mazda vehicle. The steering wheel has a prominent Mazda logo in the center and features multi-function controls on the spokes. The dashboard has analog gauges for the speedometer and tachometer, along with a central infotainment display screen. The interior appears to be in a dark gray color scheme with some silver accents on the steering wheel.", "images/car_parts/internal/0039db336f5a79.jpg": "The image depicts the steering wheel and instrument cluster of a BMW vehicle. The black leather-wrapped steering wheel features the iconic BMW roundel in the center, along with multi-function controls on the spokes. The instrument cluster shows analog gauges for speed and RPM, as well as additional digital displays. The interior trim appears to be accented with brushed aluminum and black trim pieces, giving it a sporty and premium appearance. This is a premium steering wheel and dashboard setup for a modern BMW performance vehicle.", "images/car_parts/internal/0001f145aa612c.jpg": "The image shows the steering wheel and dashboard instrumentation of a Volkswagen car model. The steering wheel has a Volkswagen logo in the center and features red accent stitching. The dashboard displays analog gauges for speed, RPM, and other vehicle metrics. The center console has controls for the radio, media, phone, and other vehicle systems. This appears to be the interior of a modern Volkswagen sedan or hatchback model.", "images/car_parts/internal/01f8e6ef5aba7c.jpg": "The image shows the instrument cluster or dashboard display of a vehicle. It has analog speedometer and tachometer gauges, as well as a digital multi-information display in the center showing details like remaining range of 20 km, outside temperature of 25.5°C, and the current gear (P R N D S). The dashboard layout and styling suggests it is from a modern vehicle, likely a sedan or SUV model, though the specific make and model are not explicitly stated in the image itself.", "images/car_parts/internal/0072a744f17878.jpg": "This image shows a close-up view of the automatic transmission gear shifter in a car's interior. The gear shift lever appears to be made of silver-colored metal and plastic materials. The gear positions are displayed digitally on a small screen next to the shift lever. The surrounding area is upholstered in gray and black tones, creating a modern and sleek aesthetic for the vehicle's interior cabin.", "images/car_parts/internal/00f803191d1fd7.jpg": "The image shows the interior center console and dashboard of a vehicle, likely a sedan or mid-size car. The make and model are not clearly identifiable, but the console features a central infotainment display screen, climate control knobs, and a manual gear shift lever, suggesting it is from a standard or base trim level vehicle. The color scheme is predominantly black and gray tones typical of many vehicle interiors.", "images/car_parts/internal/003954435de4b4.jpg": "The image shows the interior steering wheel and dashboard of a Mazda vehicle. The steering wheel has the Mazda emblem in the center and features controls for various functions. The dashboard displays the instrument cluster with analog gauges and warning lights. There is also a central infotainment touchscreen visible along with climate control and other interface buttons below it. The interior appears to be in a dark gray and black color scheme.", "images/car_parts/internal/0115329c234649.jpg": "The image shows the steering wheel and instrument cluster of an Infiniti vehicle. The steering wheel is black leather with the Infiniti logo prominently displayed in the center. It has integrated controls for audio and cruise control functions. The instrument cluster displays the speedometer, tachometer, and other vehicle information gauges in an easy-to-read format. Overall, the image highlights the premium interior design and features of an Infiniti make and model vehicle.", "images/car_parts/internal/0167f41da3dd41.jpg": "This image shows the interior dashboard and central console of a Buick car model. The dashboard features a large infotainment display screen, climate control vents, and various buttons and controls integrated into the center stack. The gear shift lever and cup holders are visible in the center console area. The steering wheel and a portion of the front seats can also be seen, giving an overall view of the modern and well-equipped cabin design.", "images/car_parts/internal/015bb16b258e97.jpg": "This image depicts the automatic transmission gear shift lever and surrounding control panel of a modern car's interior. The gear selector appears to be a chrome-trimmed lever with a leather-wrapped knob, showing the PRNDL (Park, Reverse, Neutral, Drive, Low) gear positions. The transmission controls are set in a black center console with silver accents, providing a sleek and upscale look. This automatic gear shifter assembly is a common component found in many contemporary vehicles for selecting the desired transmission gear mode.", "images/car_parts/internal/00622676992640.jpg": "The image shows the steering wheel and instrument cluster of a Jeep vehicle. The black leather-wrapped steering wheel has a prominent Jeep logo in the center, along with control buttons on the spokes. The instrument cluster displays analog gauges for speed and RPM, with smaller gauges for other vehicle information. The interior has a dark color scheme with some silver trim accents.", "images/car_parts/internal/01fa869f82f629.jpg": "The image shows the instrument cluster or speedometer of a vehicle, likely a Honda model based on the red \"H\" symbol on one of the gauges. The main speedometer dial shows speed in km/h, ranging from 0 to 200 km/h, with the needle indicating a speed of around 100 km/h. There are additional gauges for the tachometer (revolutions per minute) and fuel level. Various warning lights are illuminated, including oil, engine, and possibly anti-lock braking system (ABS) indicators. The overall design and layout suggest a modern vehicle instrument cluster with digital and analog displays.", "images/car_parts/internal/00786f016e71fe.jpg": "This image shows the interior dashboard and center console of a car. It features a gray steering wheel, beige and wood trim accents, and a multimedia system with a display screen in the center console. The gear shifter is visible in the center console area. Based on the design and layout, this appears to be the interior of a Volkswagen sedan or crossover model.", "images/car_parts/internal/0039e674607a63.jpg": "The image shows the instrument cluster or dashboard display of a car, likely a modern model. The speedometer is prominently displayed in the center, with a digital readout showing 0.3 km/h, indicating the vehicle is stationary or moving very slowly. The tachometer on the left shows the engine RPM. Additional gauges and warning lights are visible around the display. The image provides a clear view of the driver's instrumentation panel, which is important for monitoring the vehicle's speed, engine performance, and various systems while driving.", "images/car_parts/internal/00b0964255e746.jpg": "This image depicts a manual transmission gear shift knob and console of a vehicle. The gear shift pattern with 5 forward gears plus reverse is clearly visible on the top of the black leather-wrapped shift knob. The shift boot and surrounding interior surfaces appear to be in used condition. This manual transmission gear selector would allow the driver to change gears by moving the shift lever, providing hands-on control over the vehicle's gearing and performance.", "images/car_parts/internal/k1ha869f82j631.jpg": "This image shows the instrument cluster gauges of a car displaying an \"SRS Malfunction Service Required\" warning message. The cluster consists of a speedometer gauge with mph markings up to 160, a tachometer gauge showing engine revs, and a smaller gauge likely indicating brake system status or mileage with a warning light illuminated. The gauges have a modern design with backlit displays, suggesting it is from a relatively recent vehicle model. This image would be relevant for diagnostics related to the vehicle's supplemental restraint system (SRS) or brake system based on the displayed warning messages."}